---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingEccentricity
source: html/c5930cec-2bd1-1d94-43c4-e657a2090ca7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingEccentricity Property

"Eccentricity"

## Syntax (C#)
```csharp
public static ForgeTypeId ContinuousFootingEccentricity { get; }
```